app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "movies" SET "title" = 'Ridley Scott', "director" = '', "updated_at" = '2013-08-14 14:06:17.405561' WHERE "movies"."id" = 1
---
  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(params[:movie])

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = 'George Lucas'
---
  def similar
    id = params[:id]
    @movie = Movie.find(id)
    if @movie
        if @movie.director == nil or @movie.director == ""
          session[:noDirector] = @movie.title
          redirect_to movies_path and return
        else
          @allDirectorMovies = Movie.find_all_by_director(@movie.director)